YuzukiHD/TinyVision/kernel/linux-4.9/drivers/net/wireless/rtl8733bs/core/rtw_rf.c
	c_ch = rtw_get_center_ch(ch, bw, offset);
	freq = rtw_ch2freq(c_ch);

	if (!freq) {
		rtw_warn_on(1);
		goto exit;
	}

	if (bw == CHANNEL_WIDTH_160) {
		hi_ret = freq + 80;
		lo_ret = freq - 80;
	} else if (bw == CHANNEL_WIDTH_80) {
		hi_ret = freq + 40;
		lo_ret = freq - 40;
	} else if (bw == CHANNEL_WIDTH_40) {
		hi_ret = freq + 20;
		lo_ret = freq - 20;
	} else if (bw == CHANNEL_WIDTH_20) {
		hi_ret = freq + 10;
		lo_ret = freq - 10;
	} else
		rtw_warn_on(1);

	if (hi)
		*hi = hi_ret;
	if (lo)
		*lo = lo_ret;

	valid = _TRUE;

exit:
	return valid;
}

const char *const _ch_width_str[CHANNEL_WIDTH_MAX] = {
	"20MHz",
	"40MHz",
	"80MHz",
	"160MHz",
	"80_80MHz",
	"5MHz",
	"10MHz",
};

const u8 _ch_width_to_bw_cap[CHANNEL_WIDTH_MAX] = {
	BW_CAP_20M,
	BW_CAP_40M,
	BW_CAP_80M,
	BW_CAP_160M,
	BW_CAP_80_80M,
	BW_CAP_5M,
	BW_CAP_10M,
};

const char *const _band_str[] = {
	"2.4G",
	"5G",
	"BAND_MAX",
};

const u8 _band_to_band_cap[] = {
	BAND_CAP_2G,
	BAND_CAP_5G,
	0,
};

const char *const _opc_bw_str[OPC_BW_NUM] = {
	"20M ",		/* OPC_BW20 */
	"40M+",		/* OPC_BW40PLUS */
	"40M-",		/* OPC_BW40MINUS */
	"80M ",		/* OPC_BW80 */
	"160M ",	/* OPC_BW160 */
	"80+80M ",	/* OPC_BW80P80 */
};

const u8 _opc_bw_to_ch_width[OPC_BW_NUM] = {
	CHANNEL_WIDTH_20,		/* OPC_BW20 */
	CHANNEL_WIDTH_40,		/* OPC_BW40PLUS */
	CHANNEL_WIDTH_40,		/* OPC_BW40MINUS */
	CHANNEL_WIDTH_80,		/* OPC_BW80 */
	CHANNEL_WIDTH_160,		/* OPC_BW160 */
	CHANNEL_WIDTH_80_80,	/* OPC_BW80P80 */
};

/* 802.11-2016 Table E-4, partial */
static const struct op_class_map global_op_class[RTW_GLOBAL_OP_CLASS_NUM] = {
	/* 2G ch1~13, 20M */
	{81,	BAND_ON_2_4G,	OPC_BW20,		0x00001FFF},
	/* 2G ch14, 20M */
	{82,	BAND_ON_2_4G,	OPC_BW20,		0x00002000},
	/* 2G, 40M */
	{83,	BAND_ON_2_4G,	OPC_BW40PLUS,	0x000001FF},
	{84,	BAND_ON_2_4G,	OPC_BW40MINUS,	0x00001FF0},
	/* 5G band 1, 20M & 40M */
	{115,	BAND_ON_5G,		OPC_BW20,		0x0000000F},
	{116,	BAND_ON_5G,		OPC_BW40PLUS,	0x00000005},
	{117,	BAND_ON_5G,		OPC_BW40MINUS,	0x0000000A},
	/* 5G band 2, 20M & 40M */
	{118,	BAND_ON_5G,		OPC_BW20,		0x000000F0},
	{119,	BAND_ON_5G,		OPC_BW40PLUS,	0x00000050},
	{120,	BAND_ON_5G,		OPC_BW40MINUS,	0x000000A0},
	/* 5G band 3, 20M & 40M */
	{121,	BAND_ON_5G,		OPC_BW20,		0x000FFF00},
	{122,	BAND_ON_5G,		OPC_BW40PLUS,	0x00055500},
	{123,	BAND_ON_5G,		OPC_BW40MINUS,	0x000AAA00},
	/* 5G band 4, 20M & 40M */
	{124,	BAND_ON_5G,		OPC_BW20,		0x00F00000},
	{125,	BAND_ON_5G,		OPC_BW20,		0x03F00000},
	{126,	BAND_ON_5G,		OPC_BW40PLUS,	0x00500000},
	{127,	BAND_ON_5G,		OPC_BW40MINUS,	0x00A00000},
	/* 5G, 80M & 160M */
	{128,	BAND_ON_5G,		OPC_BW80,		0x00FFFFFF},
	{129,	BAND_ON_5G,		OPC_BW160,		0x0000FFFF},
	#if 0 /* TODO */
	/* 5G, 80+80M */
	{130,	BAND_ON_5G,		OPC_BW80P80,	0x0FFFFFF},
	#endif
};

static u8 global_op_class_get_ch(u8 gid, u8 cid)
{
	if (global_op_class[gid].band == BAND_ON_2_4G)
		return center_ch_2g[cid];
	if (global_op_class[gid].band == BAND_ON_5G)
		return center_ch_5g_20m[cid];

	return 0;
}

static u8 global_op_class_get_cid(u8 gid, u8 ch)
{
	if (global_op_class[gid].band == BAND_ON_2_4G)
		return ch_to_cch_2g_idx(ch);
	else if (global_op_class[gid].band == BAND_ON_5G)
		return ch_to_cch_5g_20m_idx(ch);

	return 255;
}

static void dump_op_class_ch_title(void *sel)
{
	RTW_PRINT_SEL(sel, "%-5s %-4s %-7s ch_list\n"
		, "class", "band", "bw");
}

static void dump_op_class_ch_single(void *sel, u8 gid, u32 ch_bmp, bool negtive)
{
	u8 i;
	u8 ch;

	RTW_PRINT_SEL(sel, "%5u %4s %7s"
		, global_op_class[gid].op_class
		, band_str(global_op_class[gid].band)
		, opc_bw_str(global_op_class[gid].bw)
	);

	if ((ch_bmp | global_op_class[gid].ch_bmp) != global_op_class[gid].ch_bmp) {
		RTW_WARN("invalid ch_map:0x%x of global op_class:%u", ch_bmp, global_op_class[gid].op_class);
		rtw_warn_on(1);
	}

	ch_bmp &= global_op_class[gid].ch_bmp;
	if (negtive)
		ch_bmp = (~ch_bmp) & global_op_class[gid].ch_bmp;

	for (i = 0; i < 32; i++) {
		if (!(ch_bmp & BIT(i)))
			continue;

		ch = global_op_class_get_ch(gid, i);
		if (!ch) {
			rtw_warn_on(1);
			continue;
		}

		_RTW_PRINT_SEL(sel, " %u", ch);
	}

	_RTW_PRINT_SEL(sel, "\n");
}

void dump_global_op_class(void *sel)
{
	u8 i;

	dump_op_class_ch_title(sel);

	for (i = 0; i < RTW_GLOBAL_OP_CLASS_NUM; i++)
		dump_op_class_ch_single(sel, i, global_op_class[i].ch_bmp, 0);
}

u8 rtw_get_op_class_by_chbw(u8 ch, u8 bw, u8 offset)
{
	BAND_TYPE band = BAND_MAX;
	int i, j;
	u8 op_class = 0; /* invalid */

	if (rtw_is_2g_ch(ch))
		band = BAND_ON_2_4G;
	else if (rtw_is_5g_ch(ch))
		band = BAND_ON_5G;
	else
		goto exit;

	switch (bw) {
	case CHANNEL_WIDTH_20:
	case CHANNEL_WIDTH_40:
	case CHANNEL_WIDTH_80:
	case CHANNEL_WIDTH_160:
	#if 0 /* TODO */
	case CHANNEL_WIDTH_80_80:
	#endif
		break;
	default:
		goto exit;
	}

	for (i = 0; i < RTW_GLOBAL_OP_CLASS_NUM; i++) {
		if (band != global_op_class[i].band)
			continue;

		if (opc_bw_to_ch_width(global_op_class[i].bw) != bw)
			continue;

		if ((global_op_class[i].bw == OPC_BW40PLUS
				&& offset != HAL_PRIME_CHNL_OFFSET_LOWER)
			|| (global_op_class[i].bw == OPC_BW40MINUS
				&& offset != HAL_PRIME_CHNL_OFFSET_UPPER)
		)
			continue;

		for (j = 0; j < 32; j++) {
			if (!(global_op_class[i].ch_bmp & BIT(j)))
				continue;
			if (ch == global_op_class_get_ch(i, j))
				goto get;
		}
	}

get:
	if (i < RTW_GLOBAL_OP_CLASS_NUM) {
		#if 0 /* TODO */
		if (bw == CHANNEL_WIDTH_80_80) {
			/* search another ch */
			u8 k;

			for (k = 0; k < 32; k++) {
				if (k == j || !(global_op_class[i].ch_bmp & BIT(k)))
					continue;
				if (ch2 == global_op_class_get_ch(i, k))
					break;
			}

			if (k >= 32)
				goto exit;
		}
		#endif

		op_class = global_op_class[i].op_class;
	}

exit:
	return op_class;
}

u8 rtw_get_bw_offset_by_op_class_ch(u8 op_class, u8 ch, u8 *bw, u8 *offset)
{
	u8 valid = 0;
	int i;

	for (i = 0; i < RTW_GLOBAL_OP_CLASS_NUM; i++) {
		if (global_op_class[i].op_class != op_class)
			continue;
	}

	if (i >= RTW_GLOBAL_OP_CLASS_NUM)
		goto exit;

	*bw = opc_bw_to_ch_width(global_op_class[i].bw);

	if (global_op_class[i].bw == OPC_BW40PLUS)
		*offset = HAL_PRIME_CHNL_OFFSET_LOWER;
	else if (global_op_class[i].bw == OPC_BW40MINUS)
		*offset = HAL_PRIME_CHNL_OFFSET_UPPER;

	if (rtw_get_offset_by_chbw(ch, *bw, offset))
		valid = 1;

