YuzukiHD/TinyVision/kernel/linux-4.9/drivers/net/wireless/rtl8733bs/core/rtw_rf.c
exit:
	return valid;
}

/*
* @chset: if specified, init op_class_ch_bmp to fit in current channel plan
*             if not, init, only according to capability setting
*/
u8 init_op_class_ch_bmp(_adapter *adapter, RT_CHANNEL_INFO *chset, u32 op_class_ch_bmp[])
{
	struct rf_ctl_t *rfctl = adapter_to_rfctl(adapter);
	struct registry_priv *regsty = adapter_to_regsty(adapter);
	u8 ch, bw, offset, pre_cch, cch;
	int i, j;
	u8 op_class_num = 0;
	u8 band_bmp = 0;
	u8 bw_bmp[BAND_MAX] = {0};
	u32 tmp_ch_bmp;

	if (IsSupported24G(regsty->wireless_mode) && hal_chk_band_cap(adapter, BAND_CAP_2G))
		band_bmp |= BAND_CAP_2G;
	if (is_supported_5g(regsty->wireless_mode) && hal_chk_band_cap(adapter, BAND_CAP_5G))
		band_bmp |= BAND_CAP_5G;

	bw_bmp[BAND_ON_2_4G] = (ch_width_to_bw_cap(REGSTY_BW_2G(regsty) + 1) - 1) & (GET_HAL_SPEC(adapter)->bw_cap);
	bw_bmp[BAND_ON_5G] = (ch_width_to_bw_cap(REGSTY_BW_5G(regsty) + 1) - 1) & (GET_HAL_SPEC(adapter)->bw_cap);
	if (!REGSTY_IS_11AC_ENABLE(regsty)
		|| !is_supported_vht(regsty->wireless_mode)
		|| (chset && rfctl->country_ent && !COUNTRY_CHPLAN_EN_11AC(rfctl->country_ent))
	)
		bw_bmp[BAND_ON_5G] &= ~(BW_CAP_80M | BW_CAP_160M);

	if (0) {
		RTW_INFO("REGSTY_BW_2G(regsty):%u\n", REGSTY_BW_2G(regsty));
		RTW_INFO("REGSTY_BW_5G(regsty):%u\n", REGSTY_BW_5G(regsty));
		RTW_INFO("GET_HAL_SPEC(adapter)->bw_cap:0x%x\n", GET_HAL_SPEC(adapter)->bw_cap);
		RTW_INFO("band_bmp:0x%x\n", band_bmp);
		RTW_INFO("bw_bmp[2G]:0x%x\n", bw_bmp[BAND_ON_2_4G]);
		RTW_INFO("bw_bmp[5G]:0x%x\n", bw_bmp[BAND_ON_5G]);
	}

	for (i = 0; i < RTW_GLOBAL_OP_CLASS_NUM; i++) {
		tmp_ch_bmp = 0;

		if (!(band_bmp & band_to_band_cap(global_op_class[i].band)))
			goto assign_ch_bmp;

		switch (global_op_class[i].bw) {
		case OPC_BW20:
			bw = CHANNEL_WIDTH_20;
			offset = HAL_PRIME_CHNL_OFFSET_DONT_CARE;
			break;
		case OPC_BW40PLUS:
			bw = CHANNEL_WIDTH_40;
			offset = HAL_PRIME_CHNL_OFFSET_LOWER;
			break;
		case OPC_BW40MINUS:
			bw = CHANNEL_WIDTH_40;
			offset = HAL_PRIME_CHNL_OFFSET_UPPER;
			break;
		case OPC_BW80:
			bw = CHANNEL_WIDTH_80;
			offset = HAL_PRIME_CHNL_OFFSET_DONT_CARE;
			break;
		case OPC_BW160:
			bw = CHANNEL_WIDTH_160;
			offset = HAL_PRIME_CHNL_OFFSET_DONT_CARE;
			break;
		case OPC_BW80P80: /* TODO */
		default:
			goto assign_ch_bmp;
		}

		if (!(bw_bmp[global_op_class[i].band] & ch_width_to_bw_cap(bw)))
			goto assign_ch_bmp;

		pre_cch = 0;
		for (j = 0; j < 32; j++) {
			u8 *op_chs;
			u8 op_ch_num;
			u8 k;
			int chset_idx;

			if (!(global_op_class[i].ch_bmp & BIT(j)))
				continue;

			ch = global_op_class_get_ch(i, j);
			cch = rtw_get_center_ch(ch ,bw, offset);
			/* bypass invalid or the same with previous one(already cheked) */
			if (!cch || cch == pre_cch)
				continue;
			pre_cch = cch;

			if (!rtw_get_op_chs_by_cch_bw(cch, bw, &op_chs, &op_ch_num))
				continue;

			for (k = 0; k < op_ch_num; k++) {
				if ((offset == HAL_PRIME_CHNL_OFFSET_LOWER
						&& *(op_chs + k) > cch)
					|| (offset == HAL_PRIME_CHNL_OFFSET_UPPER
						&& *(op_chs + k) < cch))
					continue;
				if (chset) {
					chset_idx = rtw_chset_search_ch(chset, *(op_chs + k));
					if (chset_idx == -1)
						break;
				}

				if (chset) {
					if (chset[chset_idx].dfs && rtw_rfctl_dfs_domain_unknown(rfctl))
						break;
					if (chset[chset_idx].ScanType == SCAN_PASSIVE)
						break;
				}
			}
			if (k < op_ch_num) /* not all op_chs are usable */
				continue;

			for (k = 0; k < op_ch_num; k++) {
				if ((offset == HAL_PRIME_CHNL_OFFSET_LOWER
						&& *(op_chs + k) > cch)
					|| (offset == HAL_PRIME_CHNL_OFFSET_UPPER
						&& *(op_chs + k) < cch))
					continue;
				tmp_ch_bmp |= BIT(global_op_class_get_cid(i, *(op_chs + k)));
			}
		}

assign_ch_bmp:
		op_class_ch_bmp[i] = tmp_ch_bmp;

		if (op_class_ch_bmp[i])
			op_class_num++;
	}

	return op_class_num;
}

void dump_cap_spt_op_class_ch(void *sel, struct rf_ctl_t *rfctl, bool negtive)
{
	u8 i;

	dump_op_class_ch_title(sel);

	for (i = 0; i < RTW_GLOBAL_OP_CLASS_NUM; i++) {
		if (!rfctl->cap_spt_op_class_ch_bmp[i])
			continue;
		dump_op_class_ch_single(sel, i, rfctl->cap_spt_op_class_ch_bmp[i], negtive);
	}

	RTW_PRINT_SEL(sel, "supported op_class number:%d\n", rfctl->cap_spt_op_class_num);
}

void dump_cur_spt_op_class_ch(void *sel, struct rf_ctl_t *rfctl, bool negtive)
{
	u8 i;

	dump_op_class_ch_title(sel);

	for (i = 0; i < RTW_GLOBAL_OP_CLASS_NUM; i++) {
		if (!rfctl->cur_spt_op_class_ch_bmp[i])
			continue;
		dump_op_class_ch_single(sel, i, rfctl->cur_spt_op_class_ch_bmp[i], negtive);
	}

	RTW_PRINT_SEL(sel, "supported op_class number:%d\n", rfctl->cur_spt_op_class_num);
}

const u8 _rf_type_to_rf_tx_cnt[RF_TYPE_MAX] = {
	1, /* RF_1T1R */
	1, /* RF_1T2R */
	2, /* RF_2T1R */
	2, /* RF_2T2R */
	1, /* RF_1T3R */
	2, /* RF_2T3R */
	3, /* RF_3T1R */
	3, /* RF_3T2R */
	3, /* RF_3T3R */
	1, /* RF_1T4R */
	2, /* RF_2T4R */
	3, /* RF_3T4R */
	4, /* RF_4T1R */
	4, /* RF_4T2R */
	4, /* RF_4T3R */
	4, /* RF_4T4R */
};

const u8 _rf_type_to_rf_rx_cnt[RF_TYPE_MAX] = {
	1, /* RF_1T1R */
	2, /* RF_1T2R */
	1, /* RF_2T1R */
	2, /* RF_2T2R */
	3, /* RF_1T3R */
	3, /* RF_2T3R */
	1, /* RF_3T1R */
	2, /* RF_3T2R */
	3, /* RF_3T3R */
	4, /* RF_1T4R */
	4, /* RF_2T4R */
	4, /* RF_3T4R */
	1, /* RF_4T1R */
	2, /* RF_4T2R */
	3, /* RF_4T3R */
	4, /* RF_4T4R */
};

const char *const _rf_type_to_rfpath_str[RF_TYPE_MAX] = {
	"RF_1T1R",		/* RF_1T1R */
	"RF_1T2R",		/* RF_1T2R */
	"RF_2T1R",		/* RF_2T1R */
	"RF_2T2R",		/* RF_2T2R */
	"RF_1T3R",		/* RF_1T3R */
	"RF_2T3R",		/* RF_2T3R */
	"RF_3T1R",		/* RF_3T1R */
	"RF_3T2R",		/* RF_3T2R */
	"RF_3T3R",		/* RF_3T3R */
	"RF_1T4R",		/* RF_1T4R */
	"RF_2T4R",		/* RF_2T4R */
	"RF_3T4R",		/* RF_3T4R */
	"RF_4T1R",		/* RF_4T1R */
	"RF_4T2R",		/* RF_4T2R */
	"RF_4T3R",		/* RF_4T3R */
	"RF_4T4R",		/* RF_4T4R */
};

void rf_type_to_default_trx_bmp(enum rf_type rf, enum bb_path *tx, enum bb_path *rx)
{
	u8 tx_num = rf_type_to_rf_tx_cnt(rf);
	u8 rx_num = rf_type_to_rf_rx_cnt(rf);
	int i;

	*tx = *rx = 0;

	for (i = 0; i < tx_num; i++)
		*tx |= BIT(i);
	for (i = 0; i < rx_num; i++)
		*rx |= BIT(i);
}

static const u8 _trx_num_to_rf_type[RF_PATH_MAX][RF_PATH_MAX] = {
	{RF_1T1R,	RF_1T2R,	RF_1T3R,	RF_1T4R},
	{RF_2T1R,	RF_2T2R,	RF_2T3R,	RF_2T4R},
	{RF_3T1R,	RF_3T2R,	RF_3T3R,	RF_3T4R},
	{RF_4T1R,	RF_4T2R,	RF_4T3R,	RF_4T4R},
};

enum rf_type trx_num_to_rf_type(u8 tx_num, u8 rx_num)
{
	if (tx_num > 0 && tx_num <= RF_PATH_MAX && rx_num > 0 && rx_num <= RF_PATH_MAX)
		return _trx_num_to_rf_type[tx_num - 1][rx_num - 1];
	return RF_TYPE_MAX;
}

enum rf_type trx_bmp_to_rf_type(u8 tx_bmp, u8 rx_bmp)
{
	u8 tx_num = 0;
	u8 rx_num = 0;
	int i;

